/*
*********************************************************************************************************
*
*	模块名称 : BSP-DMA模块
*	文件名称 : bsp_led.h
* 作    者 ：Jim
* 版    本 ：1.0
* 日    期 ：2014.08.25
*
*	说    明 : 
* 	LED驱动模块h文件。
*		CSST-STM32F407 开发板LED口线分配：
*		LED1	:	PE2		低电平点亮，高电平熄灭
*		LED2	: PE3		低电平点亮，高电平熄灭
*		LED3	: PE4		低电平点亮，高电平熄灭
*		LED4	: PE5		低电平点亮，高电平熄灭
*
* 修改记录 :
* 	版本号		日期				作者				说明
* 	V1.0		2014-08-24		Jim				创建文件，添加基本功能描述
*
*	Copyright (C), 2013-2014
*
*********************************************************************************************************
*/

#ifndef __BSP_DMA_H
#define __BSP_DMA_H

#include "bsp.h"

/* 供外部调用的函数声明 */
// void bsp_InitLed(void);
// void bsp_LedOn(uint8_t _no);
// void bsp_LedOff(uint8_t _no);
// void bsp_LedToggle(uint8_t _no);
// uint8_t bsp_IsLedOn(uint8_t _no);

#endif

/***********************************************************************************************/
